<?php
// Объявить массив, индексами которого являются буквы русского языка, а значениями – 
// соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
// Написать функцию транслитерации строк. Она должна учитывать и заглавные буквы.

/* Решение */
// ToDo: Объявим массив
$alfabet = [
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya'
    ];

$str = "Привет Мир";

for ($i = 0; $i<= mb_strlen($str); $i++){
    // echo $alfabet[mb_strtolower(mb_substr($str, $i, 1))];
    if (is_null($alfabet[mb_strtolower(mb_substr($str, $i, 1))])) {
        echo ' ';
    } else {
        echo $alfabet[mb_strtolower(mb_substr($str, $i, 1))];
    };

    //ToDo - решить проблему с отображением прописных букв
}